# 06 - Add/Remove Rows and Columns From DataFrames

https://youtu.be/HQ6XO9eT-fc?si=6STRvIlEn1b-zwp8

Notes by [Innovinitylabs](https://github.com/innovinitylabs)

In [2]:
import pandas as pd

#Setup for learning data

people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}
dft = pd.DataFrame(people)

---

#Setup for Real world data

In [3]:
# df = pd.read_csv('data/survey_results_public.csv', index_col='Respondent' )
# schema_df = pd.read_csv('data/survey_results_schema.csv', index_col='Column')
# pd.set_option('display.max_columns', 85)

In [4]:
# pd.set_option('display.max_rows', 85)

---
---
---

#### Adding and removing columns

Combining two columns into one

In [5]:
dft['first'] + ' ' + dft['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

 can assign and create a new column like this

In [6]:
dft['first_name'] = dft['first'] + ' ' + dft['last']
dft

   first     last                    email     first_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

to <mark>remove</mark> a column  
we have to use the `drop()` method on DataFrame  
###### [TimeStamp](https://youtu.be/HQ6XO9eT-fc?si=n4XTkr6gsG4xjlN9&t=184)

In [7]:
dft.drop(columns= ['first', 'last'])

                     email     first_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [8]:
dft

   first     last                    email     first_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

to make changes in place have to use  `inplace=True`

In [9]:
dft.drop(columns= ['first', 'last'], inplace=True)
dft

                     email     first_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

to <mark> create a new column from existing columns</mark>

In [13]:
dft['first_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: first_name, dtype: object